<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"ef4455fc06100484c9329fbe3fb7c132cc23a6055282a6299b2d60c94eb7aaac","plan_job_ref":"Job Test actions using target and replace #439 at https://github.com/dflook/terraform-github-actions/actions/runs/12453459388","plan_out_hash":"5f9dda801b48bd98bd5041e5b9efaec3931ad4a7a91d57ba5df1e98a5037b84f","plan_hash":"3f0a2123028546389ea5f0c66f3a634a66897a27b11d7a7ccb77f386b71c87cb","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "kWaJaFodoP" -> (known after apply)
!~  foreach = "zPqKtlal3a" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #439](https://github.com/dflook/terraform-github-actions/actions/runs/12453459388)